# config.py

# --------- Параметри для роботи програми
MASTERKEY = None # заменить на None после отладки
SHOW_MORE_IMAGES = None # виводим одно или несколько изображений наград в TAB1
DATABASE_FILE_PATH = 'awards_v4e.db' # шлях до бази даних
START_YEAR = 2014
DEF_FUT_LABEL = "Готово"  # Дефолтное сообщение в статусбаре
SHOW_MORE_IMAGES = 1
DEFAULT_FRAME_SIZE = (900, 700)
TITLE_PROG = "AWARDS 53 SMB LF AFU"
VERSION = "4.1"

# --- Визначаємо ПОВНИЙ список усіх можливих колонок ---
# Індекси тут відповідають позиціям даних у кортежі, що повертає fetch_data.ui_utils

ALL_COLUMN_LABELS = [
    "ПІБ",              # 0
    "Звання",           # 1
    "Підрозділ",        # 2
    "Подання №",      # 3
    "Дата подання",     # 4
    "Текст подання",    # 5
    "Рух",              # 6
    "Рішення",          # 7
    "Дата рішення",     # 8
    "Нагорода",         # 9 
    "Дата вручення",    # 10
    "Хто отримав",      # 11
    "Накладна",         # 12
    "Номер нагороди",   # 13
    "Посмертно",        # 14
    "РНОКПП",           # 15 
    "Дата народження"   # 16 
] 
